In [1]:
#DataFrame
#pandas

In [2]:
import numpy as np
import pandas as pd

In [7]:
from numpy.random import randn

In [22]:
df=pd.DataFrame(randn(4,4),['z','w','x','y'],['A','B','C','D'])

In [23]:
df

          A         B         C         D
z  0.099766  1.144610  1.178929 -0.347040
w -0.213025  1.725963  1.522504  0.146299
x  0.358601  0.603427 -1.176261  0.239660
y -0.166309  0.767072  0.352788  0.372466

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
df[df>0]

          A         B         C         D       new
z  0.099766  1.144610  1.178929       NaN  1.244377
w       NaN  1.725963  1.522504  0.146299  1.512938
x  0.358601  0.603427       NaN  0.239660  0.962029
y       NaN  0.767072  0.352788  0.372466  0.600763

In [61]:
df<0

       A      B      C      D    new
z  False  False  False   True  False
w   True  False  False  False  False
x  False  False   True  False  False
y   True  False  False  False  False

In [64]:
df[df>1]

    A         B         C   D       new
z NaN  1.144610  1.178929 NaN  1.244377
w NaN  1.725963  1.522504 NaN  1.512938
x NaN       NaN       NaN NaN       NaN
y NaN       NaN       NaN NaN       NaN

In [65]:
df[df>0]

          A         B         C         D       new
z  0.099766  1.144610  1.178929       NaN  1.244377
w       NaN  1.725963  1.522504  0.146299  1.512938
x  0.358601  0.603427       NaN  0.239660  0.962029
y       NaN  0.767072  0.352788  0.372466  0.600763

In [80]:
df.shape

(4, 5)

In [81]:
df[df>0].loc[['z'],['A']]

          A
z  0.099766

In [82]:
df[df['A']>0]

          A         B         C        D       new
z  0.099766  1.144610  1.178929 -0.34704  1.244377
x  0.358601  0.603427 -1.176261  0.23966  0.962029

In [83]:
df[df>0].loc[['z']]

          A        B         C   D       new
z  0.099766  1.14461  1.178929 NaN  1.244377

In [84]:
df.drop(['new'],axis=1)

          A         B         C         D
z  0.099766  1.144610  1.178929 -0.347040
w -0.213025  1.725963  1.522504  0.146299
x  0.358601  0.603427 -1.176261  0.239660
y -0.166309  0.767072  0.352788  0.372466

In [85]:
df.shape

(4, 5)

In [86]:
df[('new')]=df['A']+df['B']

In [87]:
df

          A         B         C         D       new
z  0.099766  1.144610  1.178929 -0.347040  1.244377
w -0.213025  1.725963  1.522504  0.146299  1.512938
x  0.358601  0.603427 -1.176261  0.239660  0.962029
y -0.166309  0.767072  0.352788  0.372466  0.600763

In [88]:
df.loc['z']

A      0.099766
B      1.144610
C      1.178929
D     -0.347040
new    1.244377
Name: z, dtype: float64

In [89]:
df.iloc[2]

A      0.358601
B      0.603427
C     -1.176261
D      0.239660
new    0.962029
Name: x, dtype: float64